#### IsValidExternalGeometryIdForNewCorrespondence Method

---

|  |
| --- |
| BRepBuilderPersistentIds Class   See Also |

Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool IsValidExternalGeometryIdForNewCorrespondence( 	ExternalGeometryId externalGeometryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidExternalGeometryIdForNewCorrespondence ( _ 	externalGeometryId As ExternalGeometryId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidExternalGeometryIdForNewCorrespondence( 	ExternalGeometryId^ externalGeometryId ) ``` |

#### Parameters

externalGeometryId
:   Type:  Autodesk.Revit.DB ExternalGeometryId
     The ExternalGeometryId to be used in a new correspondence.

#### Return Value

True if the input ExternalGeometryId can be used to create a new correspondence.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

BRepBuilderPersistentIds Class

Autodesk.Revit.DB Namespace